import ProgramItem from "./ProgramItem";

export default function Program() {
  const programInfo = [
    {
      id: 1,
      hasLeftBorder: true,
      title1: "1 ден (11.03.20)",
      title2: "София – Акаба",
      children: (
        <>
          <p>
            Среща на летище София, Терминал 2 в 14.30 часа Директен полет на Ryan air до Йордания-Акаба в 16.35 часа.
            Пристигане на летище Кинг Хюсиен, преминаваме митнически и гранични процедури.
          </p>
          <p>
            Трансфер към хотела, разположен в залива Tala Bay - най- престижния курорт в близост до гр. Акаба, известен
            със своите пясъчни, девствени плажове и едни от най-красивите коралови рифове на Червено море.
          </p>
          <p>Настаняване в хотел Tala Bay Resort(ex Radisson BLU)</p>
          <p>
            5*{" "}
            <a href="http://talabay.net/hotel/tala-bay-resort/" target="_blank" className="text-[#0085FF] font-bold">
              http://talabay.net/hotel/tala-bay-resort/
            </a>{" "}
            на база полупансион.
          </p>
          <p>Вечеря. Нощувка.</p>
        </>
      ),
    },
    {
      id: 2,
      hasLeftBorder: true,
      title1: "2 ден (12.03.20)",
      title2: "Акаба - Мъртво море - Мадаба - Небо - Акаба",
      children: (
        <>
          <p>Закуска. Свободно време.</p>
          <p>По желание срещу доплащане - Екскурзия до Мъртво море - Мадаба - планината Небо.</p>
          <p>
            Целодневно пътуване до най-ниската точка на земното кълбо, разположена на 420 м под морското равнище –
            Мъртво море. Цена - 90 евро с включен обяд.
          </p>
          <p>Вечеря. Нощувка.</p>
        </>
      ),
    },
    {
      id: 3,
      hasLeftBorder: true,
      title1: "3 ден (13.03.20)",
      title2: "Акаба – Вади Рум – Акаба",
      children: (
        <>
          <p>Закуска. Свободно време.</p>
          <p>
            По желание срещу доплащане - Екскурзия до пустинята Вади Рум. С автобус и джип сафари, което ще ви отведе до
            пустинята на едно недокоснато от човешката ръка място.
          </p>
          <p>Цена - 80 евро с включена вечеря в пустинен оазис. Нощувка.</p>
        </>
      ),
    },
    {
      id: 4,
      hasLeftBorder: true,
      title1: "4 ден (14.03.20)",
      title2: "Акаба – Петра – Акаба",
      children: (
        <>
          <p>Закуска.</p>
          <p>По желание срещу доплащане - Екскурзия до Петра.</p>
          <p>Градът е включен в листата на новите Седем чудеса на света на ЮНЕСКО.</p>
          <p>
            Открит е случайно през 1812 г. от швейцарския пътешественик Буркхард. Преди се е наричал “Изгубеният град” и
            е бил известен само на бедуините. До него се стига след като се прекоси пустинята и се мине през стръмен
            каньон, дълъг над 1 км, със стени високи около 200 м, наречен Сик. След това пред погледа ни се открива
            смайващата 50 метрова Съкровищница, наречена Ал-Каснех Фарун, позната ни от филма “Индиана Джонс”, в която
            се счита също, че е скрит Светия Граал.
          </p>
          <p>Цена - 130 евро с включен обяд Вечеря. Нощувка.</p>
        </>
      ),
    },
    {
      id: 5,
      hasLeftBorder: false,
      title1: "5 ден (15.03.20)",
      title2: "Акаба – София",
      children: (
        <>
          <p>Закуска. Свободно време. Късно освобождаване на стаите.</p>
          <p>В 18.00 часа трансфер до летище Кинг Хюсиен. Директен полет до София на Ryan air в 21.05 часа.</p>
        </>
      ),
    },
  ];

  return (
    <>
      <h2 className="text-[27px] font-bold">Програма</h2>
      {programInfo.map((item) => {
        return (
          <ProgramItem key={item.id} hasLeftBorder={item.hasLeftBorder} title1={item.title1} title2={item.title2}>
            {item.children}
          </ProgramItem>
        );
      })}
    </>
  );
}
